tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "romkatv/powerlevel10k"
tap "d12frosted/emacs-plus"
brew "ack"
brew "bash"
brew "bat"
brew "bat-extras"
brew "bit-git"
brew "bitwarden-cli"
brew "black"
brew "bottom"
brew "cairo"
brew "coreutils"
brew "diff-so-fancy"
brew "duti"
brew "dvc"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fpp"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-tar"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "librsvg"
brew "luarocks"
brew "macvim", link: false
brew "mas"
brew "moreutils"
brew "neovim"
brew "neovide"
brew "node"
brew "noti"
brew "page"
brew "pandoc"
brew "pass"
brew "python@3.11"
brew "ranger"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "ripgrep-all"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "ruby"
brew "rust"
brew "rustup-init"
brew "sc-im"
brew "shellcheck"
brew "tccutil"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "universal-ctags"
brew "vim"
brew "wget"
brew "xpdf"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-completions"
brew "zsh-vi-mode"
brew "zsh-you-should-use"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-native-comp", "with-spacemacs-icon"]
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-native-comp"], link: false
brew "romkatv/powerlevel10k/powerlevel10k"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "basictex"
cask "bitwarden"
cask "copyq"
cask "docker"
cask "dozer"
cask "fig"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "hyper"
cask "inkscape"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jupyterlab"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "lastpass"
cask "mambaforge"
cask "muzzle"
cask "obsidian"
cask "quarto"
cask "raycast"
cask "rightzoom"
cask "rstudio"
cask "slack"
cask "tabby"
cask "vimr"
cask "visual-studio-code"
cask "vscodium"
cask "zotero"
mas "Vimari", id: 1480933944
vscode "asvetliakov.vscode-neovim"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "quarto.quarto"
vscode "REditorSupport.r"
vscode "TabNine.tabnine-vscode"